app/app/controllers/job_roles_controller.rb

  def index
    @job_roles = JobRole.all
---
SELECT "job_roles".* FROM "job_roles"

  def create
    @job_role = JobRole.new(job_role_params)

    respond_to do |format|
      if @job_role.save
---
INSERT INTO "job_roles" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "JR A"], ["created_at", "2022-12-16 01:28:12.924241"], ["updated_at", "2022-12-16 01:28:12.924241"]]

  def destroy
    @job_role.destroy
---
DELETE FROM "job_roles" WHERE "job_roles"."id" = ?  [["id", 3]]

    def set_job_role
      @job_role = JobRole.find_by(id: params[:id])
---
SELECT "job_roles".* FROM "job_roles" WHERE "job_roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]