app/app/controllers/people_controller.rb

SELECT  "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "job_roles".* FROM "job_roles" WHERE "job_roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "people".* FROM "people" WHERE "people"."user_id" = $1 ORDER BY "people"."description" ASC  [["user_id", 1]]
SELECT "job_roles".* FROM "job_roles" WHERE "job_roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "people" WHERE "people"."job_role_id" = $1 AND "people"."workspace_id" = $2 LIMIT $3  [["job_role_id", 1], ["workspace_id", 1], ["LIMIT", 1]]
SELECT "people".* FROM "people" ORDER BY "people"."description" ASC
---
  def index
    if authenticate_adm?
      @people = Person.all
      @people = @people.where(("description like '%#{params[:search]}%'")).or(Person.where("cast(registration as text) like '%#{params[:search]}%'")) if params[:search].present?
      @people = @people.where(workspace_id: params[:search_workspace]) if params[:search_workspace].present?
      @people = @people.where(job_role_id: params[:search_job_role]) if params[:search_job_role].present?
      @people = @people.where(sex: params[:search_sex]) if params[:search_sex].present?
      @people = @people.order(:description)
    else
      @people = current_user.people
      @people = @people.where(("description like '%#{params[:search]}%'")).or(Person.where("cast(registration as text) like '%#{params[:search]}%'")) if params[:search].present?
      @people = @people.where(workspace_id: params[:search_workspace]) if params[:search_workspace].present?
      @people = @people.where(job_role_id: params[:search_job_role]) if params[:search_job_role].present?
      @people = @people.where(sex: params[:search_sex]) if params[:search_sex].present?
      @people = @people.order(:description)

INSERT INTO "people" ("description", "registration", "birth_date", "birth_county", "marital_status", "sex", "workspace_id", "job_role_id", "created_at", "updated_at", "birth_state", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @person = current_user.people.build(person_params)

    respond_to do |format|
      if @person.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."person_id" = ?  [["person_id", 1]]
SELECT COUNT(*) FROM "contacts" WHERE "contacts"."person_id" = ?  [["person_id", 1]]
SELECT "people".* FROM "people" WHERE "people"."user_id" = $1 AND "people"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
---
    def set_person
      if authenticate_adm?
        @person = Person.all.find_by(id: params[:id])
        @contacts = Contact.where(person_id: params[:id]).paginate(page: params[:page], per_page: 5)
        self.send_error_info unless @person.present?
      else
        @person = current_user.people.find_by(id: params[:id])

SELECT "job_roles"."title", "job_roles"."id" FROM "job_roles"
---
    def job_role_title
      @job_role_title = JobRole.all.pluck(:title, :id)

SELECT "workspaces"."title", "workspaces"."id" FROM "workspaces"
---
    def workspace_title
      @workspace_title = Workspace.all.pluck(:title, :id)