app/app/controllers/workspaces_controller.rb

  def index
    @workspaces = Workspace.all
---
SELECT "workspaces".* FROM "workspaces"

  def create
    @workspace = Workspace.new(workspace_params)

    respond_to do |format|
      if @workspace.save
---
INSERT INTO "workspaces" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "WS A"], ["created_at", "2022-12-16 01:27:54.968803"], ["updated_at", "2022-12-16 01:27:54.968803"]]

    def set_workspace
      @workspace = Workspace.find_by(id: params[:id])
---
SELECT "workspaces".* FROM "workspaces" WHERE "workspaces"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]