app/app/views/people/index.html.erb

SELECT "workspaces"."title", "workspaces"."id" FROM "workspaces"
---
            <div>
              <%= select_tag 'search_workspace', options_for_select(@workspace_title.collect{ |u| [u[0], u[1]] }), {include_blank: 'Selecione a Lotação...', class:"form-select"}%>

SELECT "job_roles"."title", "job_roles"."id" FROM "job_roles"
---
            <div>
              <%= select_tag 'search_job_role', options_for_select(@job_role_title.collect{ |u| [u[0], u[1]] }), {include_blank: 'Selecione o Cargo...', class: "form-select"}%>